{
  "architectures": [
    "PatchTSMixerForForecasting"
  ],
  "channel_consistent_masking": true,
  "distribution_output": "student_t",
  "dropout": 0.5,
  "expansion_factor": 3,
  "forecast_channel_indices": null,
  "forecast_len": 288,
  "gated_attn": true,
  "head_agg": "max_pool",
  "head_dropout": 0.7,
  "in_channels": 7,
  "init_std": 0.02,
  "learn_positional_encoding": false,
  "loss": "mse",
  "mask_patch_ratios": [
    1,
    1
  ],
  "mask_patches": [
    2,
    3
  ],
  "mask_ratio": 0.5,
  "mask_type": "random",
  "mask_value": 0,
  "masked_loss": true,
  "mode": "common_channel",
  "model_type": "patchtsmixer",
  "norm_mlp": "LayerNorm",
  "num_features": 48,
  "num_input_channels": 1,
  "num_layers": 2,
  "num_parallel_samples": 100,
  "num_patches": 96,
  "num_targets": 3,
  "output_range": null,
  "patch_last": true,
  "patch_len": 16,
  "positional_encoding": "zeros",
  "post_init": false,
  "revin": false,
  "scaling": false,
  "seed_number": null,
  "self_attn": false,
  "self_attn_heads": 1,
  "seq_len": 1536,
  "stride": 16,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0.dev0",
  "use_positional_encoding": false
}
